# Задача №11 (Сторока)

"""
Дана строка, состоящая из слов, разделенных пробелами.
Определите, сколько в ней слов.
Используйте для решения задачи функцию `count()`
"""

s = 'Given a string.'

print('В данной строке', s.count(' ') + 1, 'слов(а).')
